In [270]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')

In [271]:
df = pd.read_csv('data-folder/house_prices.csv')

In [272]:
df.head(5)

,Index,Title,Description,Amount(in rupees),Price (in rupees),location,Carpet Area,Status,Floor,Transaction,...,facing,overlooking,Society,Bathroom,Balcony,Car Parking,Ownership,Super Area,Dimensions,Plot Area
0,0,1 BHK Ready to Occupy Flat for sale in Srushti...,"Bhiwandi, Thane has an attractive 1 BHK Flat f...",42 Lac,6000.0,thane,500 sqft,Ready to Move,10 out of 11,Resale,...,NaN,NaN,Srushti Siddhi Mangal Murti Complex,1,2,NaN,NaN,NaN,NaN,NaN
1,1,2 BHK Ready to Occupy Flat for sale in Dosti V...,One can find this stunning 2 BHK flat for sale...,98 Lac,13799.0,thane,473 sqft,Ready to Move,3 out of 22,Resale,...,East,Garden/Park,Dosti Vihar,2,NaN,1 Open,Freehold,NaN,NaN,NaN
2,2,2 BHK Ready to Occupy Flat for sale in Sunrise...,Up for immediate sale is a 2 BHK apartment in ...,1.40 Cr,17500.0,thane,779 sqft,Ready to Move,10 out of 29,Resale,...,East,Garden/Park,Sunrise by Kalpataru,2,NaN,1 Covered,Freehold,NaN,NaN,NaN
3,3,1 BHK Ready to Occupy Flat for sale Kasheli,This beautiful 1 BHK Flat is available for sal...,25 Lac,NaN,thane,530 sqft,Ready to Move,1 out of 3,Resale,...,NaN,NaN,NaN,1,1,NaN,NaN,NaN,NaN,NaN
4,4,2 BHK Ready to Occupy Flat for sale in TenX Ha...,"This lovely 2 BHK Flat in Pokhran Road, Thane ...",1.60 Cr,18824.0,thane,635 sqft,Ready to Move,20 out of 42,Resale,...,West,"Garden/Park, Main Road",TenX Habitat Raymond Realty,2,NaN,1 Covered,Co-operative Society,NaN,NaN,NaN

##EDA

In [273]:
len(df.columns)

21

In [274]:
df.isnull().sum()

Index                     0
Title                     0
Description            3023
Amount(in rupees)         0
Price (in rupees)     17665
location                  0
Carpet Area           80673
Status                  615
Floor                  7077
Transaction              83
Furnishing             2897
facing                70233
overlooking           81436
Society              109678
Bathroom                828
Balcony               48935
Car Parking          103357
Ownership             65517
Super Area           107685
Dimensions           187531
Plot Area            187531
dtype: int64

In [275]:
df = df.drop(['Plot Area', 'Car Parking','Dimensions','Balcony','Super Area','Title','Society','Description','Status','overlooking','Ownership','Transaction'],axis='columns')

In [276]:
# df.drop(['Dimensions'],axis=1,inplace=True)

In [277]:
# df["Plot Area"].value_counts()

In [278]:
# df.drop(['Plot Area'],axis=1,inplace=True)

In [279]:
df.tail(5)

,Index,Amount(in rupees),Price (in rupees),location,Carpet Area,Floor,Furnishing,facing,Bathroom
187526,187526,63 Lac,3225.0,zirakpur,NaN,2 out of 4,Semi-Furnished,East,3
187527,187527,55 Lac,3274.0,zirakpur,NaN,4 out of 6,Unfurnished,North - East,3
187528,187528,76 Lac,4343.0,zirakpur,1250 sqft,1 out of 3,Furnished,East,3
187529,187529,30 Lac,4231.0,zirakpur,NaN,2 out of 2,Semi-Furnished,NaN,2
187530,187530,1.18 Cr,6162.0,zirakpur,NaN,5 out of 13,Semi-Furnished,North - East,4

In [280]:
df.head(5)

,Index,Amount(in rupees),Price (in rupees),location,Carpet Area,Floor,Furnishing,facing,Bathroom
0,0,42 Lac,6000.0,thane,500 sqft,10 out of 11,Unfurnished,NaN,1
1,1,98 Lac,13799.0,thane,473 sqft,3 out of 22,Semi-Furnished,East,2
2,2,1.40 Cr,17500.0,thane,779 sqft,10 out of 29,Unfurnished,East,2
3,3,25 Lac,NaN,thane,530 sqft,1 out of 3,Unfurnished,NaN,1
4,4,1.60 Cr,18824.0,thane,635 sqft,20 out of 42,Unfurnished,West,2

In [281]:
df.isna().sum()

Index                    0
Amount(in rupees)        0
Price (in rupees)    17665
location                 0
Carpet Area          80673
Floor                 7077
Furnishing            2897
facing               70233
Bathroom               828
dtype: int64

In [282]:
df["Price (in rupees)"] = df["Price (in rupees)"].transform(lambda x: x.fillna(x.mean()))

In [283]:
df.head(10)

,Index,Amount(in rupees),Price (in rupees),location,Carpet Area,Floor,Furnishing,facing,Bathroom
0,0,42 Lac,6000.000000,thane,500 sqft,10 out of 11,Unfurnished,NaN,1
1,1,98 Lac,13799.000000,thane,473 sqft,3 out of 22,Semi-Furnished,East,2
2,2,1.40 Cr,17500.000000,thane,779 sqft,10 out of 29,Unfurnished,East,2
3,3,25 Lac,7583.771885,thane,530 sqft,1 out of 3,Unfurnished,NaN,1
4,4,1.60 Cr,18824.000000,thane,635 sqft,20 out of 42,Unfurnished,West,2
5,5,45 Lac,6618.000000,thane,NaN,2 out of 7,Unfurnished,East,1
6,6,16.5 Lac,2538.000000,thane,550 sqft,4 out of 5,Unfurnished,NaN,1
7,7,60 Lac,10435.000000,thane,NaN,Ground out of 7,Furnished,NaN,1
8,8,60 Lac,10000.000000,thane,NaN,Ground out of 2,Furnished,NaN,1
9,9,1.60 Cr,11150.000000,thane,900 sqft,3 out of 27,Unfurnished,East,3

In [284]:
df.info()
df.shape
df.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 187531 entries, 0 to 187530
Data columns (total 9 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   Index              187531 non-null  int64
 1   Amount(in rupees)  187531 non-null  object
 2   Price (in rupees)  187531 non-null  float64
 3   location           187531 non-null  object
 4   Carpet Area        106858 non-null  object
 5   Floor              180454 non-null  object
 6   Furnishing         184634 non-null  object
 7   facing             117298 non-null  object
 8   Bathroom           186703 non-null  object
dtypes: float64(1), int64(1), object(7)
memory usage: 12.9+ MB

Index                    0
Amount(in rupees)        0
Price (in rupees)        0
location                 0
Carpet Area          80673
Floor                 7077
Furnishing            2897
facing               70233
Bathroom               828
dtype: int64

In [285]:
# df["Carpet Area"] = df["Carpet Area"].transform(lambda x: x.fillna(x.mean()))

def calculate_carpetArea():
  total = 0
  count = 0
  for i in df["Carpet Area"]:
    try:
      if i.lower() != "nan":
        total += int(i.split(" ")[0])
        count += 1
    except:
      pass
  return total, count

ca, count = calculate_carpetArea()
print(ca)
print(ca/count)
print(ca/df["Carpet Area"].count())

128207714
1199.7951861348706
1199.7951861348706

In [286]:
df['Carpet Area'] = df['Carpet Area'].transform(lambda x: x.fillna(float(ca/count)))

In [287]:
df["Carpet Area"] = df["Carpet Area"].astype(str).transform(lambda x: x.split(" ")[0])
df.head(10)

df["Carpet Area"] = df["Carpet Area"].astype(float)

In [288]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 187531 entries, 0 to 187530
Data columns (total 9 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   Index              187531 non-null  int64
 1   Amount(in rupees)  187531 non-null  object
 2   Price (in rupees)  187531 non-null  float64
 3   location           187531 non-null  object
 4   Carpet Area        187531 non-null  float64
 5   Floor              180454 non-null  object
 6   Furnishing         184634 non-null  object
 7   facing             117298 non-null  object
 8   Bathroom           186703 non-null  object
dtypes: float64(2), int64(1), object(6)
memory usage: 12.9+ MB

In [289]:
df.head(7)

,Index,Amount(in rupees),Price (in rupees),location,Carpet Area,Floor,Furnishing,facing,Bathroom
0,0,42 Lac,6000.000000,thane,500.000000,10 out of 11,Unfurnished,NaN,1
1,1,98 Lac,13799.000000,thane,473.000000,3 out of 22,Semi-Furnished,East,2
2,2,1.40 Cr,17500.000000,thane,779.000000,10 out of 29,Unfurnished,East,2
3,3,25 Lac,7583.771885,thane,530.000000,1 out of 3,Unfurnished,NaN,1
4,4,1.60 Cr,18824.000000,thane,635.000000,20 out of 42,Unfurnished,West,2
5,5,45 Lac,6618.000000,thane,1199.795186,2 out of 7,Unfurnished,East,1
6,6,16.5 Lac,2538.000000,thane,550.000000,4 out of 5,Unfurnished,NaN,1

In [290]:
# df["Transaction"].value_counts()

In [291]:
def convert_rupees(amount_str):
    try:
        parts=amount_str.split()
        amount=float(parts[0])

        if len(parts)>1:
            unit=parts[1].strip()
            if unit=='Lac':
                amount*=100000
            elif unit=='Cr':
                amount*=10000000
        return amount
    except(ValueError,IndexError):
        return None

df['Amount(in rupees)']= df['Amount(in rupees)'].apply(convert_rupees)

In [292]:
df.rename(columns={'Amount(in rupees)': 'Amount_in_rupees', 'Price (in rupees)': 'Price_in_rupees', 'Carpet Area': 'Carpet_Area_in_sqft'}, inplace=True)

In [293]:
df.isnull().sum()

Index                      0
Amount_in_rupees        9684
Price_in_rupees            0
location                   0
Carpet_Area_in_sqft        0
Floor                   7077
Furnishing              2897
facing                 70233
Bathroom                 828
dtype: int64

In [294]:
# df = df.drop(["Transaction", ""],axis='columns')

In [295]:
df.info()

# dummies = pd.get_dummies(df.location,dummy_na=False,dtype=int)
# df = pd.concat([df,dummies],axis='columns'  )

df.head(10)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 187531 entries, 0 to 187530
Data columns (total 9 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   Index                187531 non-null  int64
 1   Amount_in_rupees     177847 non-null  float64
 2   Price_in_rupees      187531 non-null  float64
 3   location             187531 non-null  object
 4   Carpet_Area_in_sqft  187531 non-null  float64
 5   Floor                180454 non-null  object
 6   Furnishing           184634 non-null  object
 7   facing               117298 non-null  object
 8   Bathroom             186703 non-null  object
dtypes: float64(3), int64(1), object(5)
memory usage: 12.9+ MB

,Index,Amount_in_rupees,Price_in_rupees,location,Carpet_Area_in_sqft,Floor,Furnishing,facing,Bathroom
0,0,4200000.0,6000.000000,thane,500.000000,10 out of 11,Unfurnished,NaN,1
1,1,9800000.0,13799.000000,thane,473.000000,3 out of 22,Semi-Furnished,East,2
2,2,14000000.0,17500.000000,thane,779.000000,10 out of 29,Unfurnished,East,2
3,3,2500000.0,7583.771885,thane,530.000000,1 out of 3,Unfurnished,NaN,1
4,4,16000000.0,18824.000000,thane,635.000000,20 out of 42,Unfurnished,West,2
5,5,4500000.0,6618.000000,thane,1199.795186,2 out of 7,Unfurnished,East,1
6,6,1650000.0,2538.000000,thane,550.000000,4 out of 5,Unfurnished,NaN,1
7,7,6000000.0,10435.000000,thane,1199.795186,Ground out of 7,Furnished,NaN,1
8,8,6000000.0,10000.000000,thane,1199.795186,Ground out of 2,Furnished,NaN,1
9,9,16000000.0,11150.000000,thane,900.000000,3 out of 27,Unfurnished,East,3

In [296]:
df["Bathroom"] = pd.to_numeric(df["Bathroom"], errors='coerce')

In [297]:
# df.drop('overlooking',axis='columns',inplace=True)

In [298]:
# df.drop('location',axis='columns',inplace=True)

In [299]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 187531 entries, 0 to 187530
Data columns (total 9 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   Index                187531 non-null  int64
 1   Amount_in_rupees     177847 non-null  float64
 2   Price_in_rupees      187531 non-null  float64
 3   location             187531 non-null  object
 4   Carpet_Area_in_sqft  187531 non-null  float64
 5   Floor                180454 non-null  object
 6   Furnishing           184634 non-null  object
 7   facing               117298 non-null  object
 8   Bathroom             186668 non-null  float64
dtypes: float64(4), int64(1), object(4)
memory usage: 12.9+ MB

In [300]:
from sklearn.preprocessing import LabelEncoder
# Function to perform Label Encoding for multiple columns
def label_encode_multiple(df, columns):
    le = LabelEncoder()
    for column in columns:
        df[column] = le.fit_transform(df[column])
    return df

label_encode_columns = ['Floor', 'Furnishing', 'facing', 'location']
df = label_encode_multiple(df, label_encode_columns)

In [301]:
df["Amount_in_rupees"] = df["Amount_in_rupees"].transform(lambda x: x.fillna(x.mean()))

In [302]:
df["Bathroom"] = df["Bathroom"].transform(lambda x: x.fillna(x.mean()))

In [303]:
cols = df.columns

In [304]:
# for col in cols:
#   print(col,df[col].isna().sum())

##Model building

In [305]:
from sklearn.linear_model import LinearRegression
from sklearn.svm import SVR
from sklearn.tree import DecisionTreeRegressor
from sklearn.ensemble import RandomForestRegressor
from sklearn.neighbors import KNeighborsRegressor
from sklearn.ensemble import GradientBoostingRegressor
from xgboost import XGBRegressor
from sklearn.metrics import r2_score, mean_absolute_error, mean_squared_error
from sklearn.model_selection import train_test_split

SyntaxError: invalid syntax (2521505324.py, line 9)

In [308]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 187531 entries, 0 to 187530
Data columns (total 8 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   Amount_in_rupees     187531 non-null  float64
 1   Price_in_rupees      187531 non-null  float64
 2   location             187531 non-null  int64
 3   Carpet_Area_in_sqft  187531 non-null  float64
 4   Floor                187531 non-null  int64
 5   Furnishing           187531 non-null  int64
 6   facing               187531 non-null  int64
 7   Bathroom             187531 non-null  float64
dtypes: float64(4), int64(4)
memory usage: 11.4 MB

In [307]:
df.drop("Index",axis='columns',inplace=True)

In [309]:
X = df.drop('Amount_in_rupees',axis='columns')
Y = df.Amount_in_rupees

In [310]:
X.head(5)

,Price_in_rupees,location,Carpet_Area_in_sqft,Floor,Furnishing,facing,Bathroom
0,6000.000000,67,500.0,40,2,8,1.0
1,13799.000000,67,473.0,551,1,0,2.0
2,17500.000000,67,779.0,58,2,0,2.0
3,7583.771885,67,530.0,24,2,8,1.0
4,18824.000000,67,635.0,381,2,7,2.0

In [311]:
X["Price_in_rupees"].isna().sum()

np.int64(0)

In [312]:
x_train,x_test,y_train,y_test = train_test_split(X,Y,test_size=0.2,random_state=10)

In [186]:
# models = {
#     'Linear Regression': LinearRegression(),
#     'Decision Tree Regressor': DecisionTreeRegressor(),
#     'Random Forest': RandomForestRegressor(random_state=42),
#     'Knr': KNeighborsRegressor(),
#     'Gradient Boosting': GradientBoostingRegressor(random_state=42),
#     'XGBRegressor': XGBRegressor(),
#     # 'Support Vector Regressor': SVR()
# }

# for model_name, model in models.items():
#     model.fit(x_train, y_train)
#     y_pred = model.predict(x_test)

#     # Evaluate the model
#     r2 = r2_score(y_test, y_pred)
#     mae = mean_absolute_error(y_test, y_pred)
#     rmse = np.sqrt(mean_squared_error(y_test, y_pred))
#     scoree = model.score(x_test,y_test)

#     print(f'{model_name}:')
#     print(f'R-squared: {r2:.2f}')
#     print(f'Mean Absolute Error (MAE): {mae:.2f}')
#     print(f'Root Mean Squared Error (RMSE): {rmse:.2f}')
#     print(f'Accuracy of Model:{scoree:.2f}')
#     print('****************************************')

In [313]:
model = RandomForestRegressor(random_state=42)

model.fit(x_train, y_train)
y_pred = model.predict(x_test)

##Save the model

In [120]:
r2 = r2_score(y_test, y_pred)
mae = mean_absolute_error(y_test, y_pred)
rmse = np.sqrt(mean_squared_error(y_test, y_pred))
scoree = model.score(x_test,y_test)

In [121]:

print(f'R-squared: {r2:.2f}')
print(f'Mean Absolute Error (MAE): {mae:.2f}')
print(f'Root Mean Squared Error (RMSE): {rmse:.2f}')
print(f'Accuracy of Model:{scoree:.2f}')

R-squared: 0.91
Mean Absolute Error (MAE): 638052.71
Root Mean Squared Error (RMSE): 4233257.97
Accuracy of Model:0.91

In [124]:
import joblib

# joblib.dump(model, "housePriceModel.pkl")

# Load the model
# loaded_model = joblib.load("housePriceModel.pkl")

['housePriceModel.pkl']